backend/controllers/DiscountsController.php

SELECT * FROM `discounts`
---
    public function actionIndex()
    {
        $discounts = Discounts::find()->all();

SELECT * FROM `discounts` WHERE `Id`='1'
---
    protected function findModel($id)
    {
        if (($model = Discounts::findOne($id)) !== null) {