backend/controllers/NewsController.php

INSERT INTO `News` (`Name`, `Content`) VALUES ('efdfds', 'dsfdsfd')
---
    public function actionCreate()
    {
        $model = new News();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `News` WHERE `Id`='2'
---
    protected function findModel($id)
    {
        if (($model = News::findOne($id)) !== null) {