backend/controllers/ProductController.php

    public function actionIndex()
    {
        $products = Product::find()->all();
---
SELECT * FROM `product`