backend/controllers/UserController.php

SELECT * FROM `user`
---
    public function actionIndex()
    {
        $user = User::find()->all();