frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $news= News::Find()->all();
        $discounts= Discounts::Find()->all();
---
SELECT * FROM `News`
SELECT * FROM `discounts`

    public function actionProducts()
    {
        $product = Product::find()->all();
---
SELECT * FROM `product`

    public function actionView($id)
    {
        $product = Product::findOne($id);
---
SELECT * FROM `product` WHERE `Id`='2'